MicrochipTech/ethercat-software-framework/ESF/Demo/ESF_EVB_PIC32_LAN925x/firmware/src/packs/PIC32MX_DFP/1.4.241/edc/PIC32MX450F256H.PIC
      <edc:SFRDef edc:_addr="0x1F886170" edc:_begin="0x0" edc:_end="0xa0" edc:_modsrc="DOS-01618_TRAE_Ports.Module" edc:_refcount="1" edc:access="----------------n-n-------------" edc:cname="CNCONB" edc:desc="" edc:grp="PORTB" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000000000000000000000000000" edc:name="CNCONB" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" edc:portals="CLR SET INV" ltx:memberofperipheral="PORTB">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:AdjustPoint edc:offset="13"/>
            <edc:SFRFieldDef edc:cname="SIDL" edc:desc="" edc:mask="0x1" edc:name="SIDL" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="FRZ" edc:desc="" edc:ishidden="true" edc:islanghidden="true" edc:mask="0x1" edc:name="FRZ" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ON" edc:desc="" edc:mask="0x1" edc:name="ON" edc:nzwidth="0x1"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0x1" edc:name="w" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
        <edc:FreezeBit edc:freezeval="1" edc:name="CHANGE NOTICE" edc:pos="14"/>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F886180" edc:_begin="0x0" edc:_end="0xa0" edc:_modsrc="DOS-01618_TRAE_Ports.Module" edc:_refcount="1" edc:access="----------------nnnnnnnnnnnnnnnn" edc:cname="CNENB" edc:desc="" edc:grp="PORTB" edc:impl="0xffc0ffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="0000000000------xxxxxxxxxxxxxxxx" edc:name="CNENB" edc:nzwidth="0x20" edc:por="0000000000------xxxxxxxxxxxxxxxx" edc:portals="CLR SET INV" ltx:memberofperipheral="PORTB">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="CNIEB0" edc:desc="" edc:mask="0x1" edc:name="CNIEB0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNIEB1" edc:desc="" edc:mask="0x1" edc:name="CNIEB1" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNIEB2" edc:desc="" edc:mask="0x1" edc:name="CNIEB2" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNIEB3" edc:desc="" edc:mask="0x1" edc:name="CNIEB3" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNIEB4" edc:desc="" edc:mask="0x1" edc:name="CNIEB4" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNIEB5" edc:desc="" edc:mask="0x1" edc:name="CNIEB5" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNIEB6" edc:desc="" edc:mask="0x1" edc:name="CNIEB6" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNIEB7" edc:desc="" edc:mask="0x1" edc:name="CNIEB7" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNIEB8" edc:desc="" edc:mask="0x1" edc:name="CNIEB8" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNIEB9" edc:desc="" edc:mask="0x1" edc:name="CNIEB9" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNIEB10" edc:desc="" edc:mask="0x1" edc:name="CNIEB10" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNIEB11" edc:desc="" edc:mask="0x1" edc:name="CNIEB11" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNIEB12" edc:desc="" edc:mask="0x1" edc:name="CNIEB12" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNIEB13" edc:desc="" edc:mask="0x1" edc:name="CNIEB13" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNIEB14" edc:desc="" edc:mask="0x1" edc:name="CNIEB14" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNIEB15" edc:desc="" edc:mask="0x1" edc:name="CNIEB15" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0x1" edc:name="w" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F886190" edc:_begin="0x0" edc:_end="0xa0" edc:_modsrc="DOS-01618_TRAE_Ports.Module" edc:_refcount="1" edc:access="----------------nnnnnnnnnnnnnnnn" edc:cname="CNSTATB" edc:desc="" edc:grp="PORTB" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------xxxxxxxxxxxxxxxx" edc:name="CNSTATB" edc:nzwidth="0x20" edc:por="----------------xxxxxxxxxxxxxxxx" edc:portals="CLR SET INV" ltx:memberofperipheral="PORTB">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="CNSTATB0" edc:desc="" edc:mask="0x1" edc:name="CNSTATB0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNSTATB1" edc:desc="" edc:mask="0x1" edc:name="CNSTATB1" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNSTATB2" edc:desc="" edc:mask="0x1" edc:name="CNSTATB2" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNSTATB3" edc:desc="" edc:mask="0x1" edc:name="CNSTATB3" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNSTATB4" edc:desc="" edc:mask="0x1" edc:name="CNSTATB4" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNSTATB5" edc:desc="" edc:mask="0x1" edc:name="CNSTATB5" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNSTATB6" edc:desc="" edc:mask="0x1" edc:name="CNSTATB6" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNSTATB7" edc:desc="" edc:mask="0x1" edc:name="CNSTATB7" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNSTATB8" edc:desc="" edc:mask="0x1" edc:name="CNSTATB8" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNSTATB9" edc:desc="" edc:mask="0x1" edc:name="CNSTATB9" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNSTATB10" edc:desc="" edc:mask="0x1" edc:name="CNSTATB10" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNSTATB11" edc:desc="" edc:mask="0x1" edc:name="CNSTATB11" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNSTATB12" edc:desc="" edc:mask="0x1" edc:name="CNSTATB12" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNSTATB13" edc:desc="" edc:mask="0x1" edc:name="CNSTATB13" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNSTATB14" edc:desc="" edc:mask="0x1" edc:name="CNSTATB14" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNSTATB15" edc:desc="" edc:mask="0x1" edc:name="CNSTATB15" edc:nzwidth="0x1"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0x1" edc:name="w" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x1F8861A0" edc:offset="96"/>
      <edc:SFRDef edc:_addr="0x1F886200" edc:_begin="0x0" edc:_end="0xa0" edc:_modsrc="DOS-01618_TRAE_Ports.Module" edc:_refcount="2" edc:access="----------------nnnn------------" edc:cname="ANSELC" edc:desc="" edc:grp="PORTC" edc:impl="0xfffff000" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------1111------------" edc:name="ANSELC" edc:nzwidth="0x20" edc:por="----------------1111------------" edc:portals="CLR SET INV">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="ANSC12" edc:desc="" edc:mask="0x1" edc:name="ANSC12" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ANSC13" edc:desc="" edc:mask="0x1" edc:name="ANSC13" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ANSC14" edc:desc="" edc:mask="0x1" edc:name="ANSC14" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ANSC15" edc:desc="" edc:mask="0x1" edc:name="ANSC15" edc:nzwidth="0x1"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0x0" edc:name="w" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
        <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="rwb" edc:stimtype="Record"/>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F886210" edc:_begin="0x0" edc:_end="0xa0" edc:_modsrc="DOS-01618_TRAE_Ports.Module" edc:_refcount="2" edc:access="----------------nnnn------------" edc:cname="TRISC" edc:desc="" edc:grp="PORTC" edc:impl="0xfffff000" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------1111------------" edc:name="TRISC" edc:nzwidth="0x20" edc:por="----------------1111------------" edc:portals="CLR SET INV">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="TRISC12" edc:desc="" edc:mask="0x1" edc:name="TRISC12" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="TRISC13" edc:desc="" edc:mask="0x1" edc:name="TRISC13" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="TRISC14" edc:desc="" edc:mask="0x1" edc:name="TRISC14" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TRISC15" edc:desc="" edc:mask="0x1" edc:name="TRISC15" edc:nzwidth="0x1"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0x0" edc:name="w" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
        <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="rwb" edc:stimtype="Record"/>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F886220" edc:_begin="0x0" edc:_end="0xa0" edc:_modsrc="DOS-01618_TRAE_Ports.Module" edc:_refcount="2" edc:access="----------------nnnn------------" edc:cname="PORTC" edc:desc="" edc:grp="PORTC" edc:impl="0xfffff000" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------xxxx------------" edc:name="PORTC" edc:nzwidth="0x20" edc:por="----------------xxxx------------" edc:portals="CLR SET INV" ltx:baseofperipheral="PORTC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="RC12" edc:desc="" edc:mask="0x1" edc:name="RC12" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="RC13" edc:desc="" edc:mask="0x1" edc:name="RC13" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="RC14" edc:desc="" edc:mask="0x1" edc:name="RC14" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RC15" edc:desc="" edc:mask="0x1" edc:name="RC15" edc:nzwidth="0x1"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0x0" edc:name="w" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
        <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="rwb" edc:stimtype="Record"/>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F886230" edc:_begin="0x0" edc:_end="0xa0" edc:_modsrc="DOS-01618_TRAE_Ports.Module" edc:_refcount="2" edc:access="----------------nnnn------------" edc:cname="LATC" edc:desc="" edc:grp="PORTC" edc:impl="0xfffff000" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------xxxx------------" edc:name="LATC" edc:nzwidth="0x20" edc:por="----------------xxxx------------" edc:portals="CLR SET INV" ltx:memberofperipheral="PORTC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="LATC12" edc:desc="" edc:mask="0x1" edc:name="LATC12" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="LATC13" edc:desc="" edc:mask="0x1" edc:name="LATC13" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="LATC14" edc:desc="" edc:mask="0x1" edc:name="LATC14" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="LATC15" edc:desc="" edc:mask="0x1" edc:name="LATC15" edc:nzwidth="0x1"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0x0" edc:name="w" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
        <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="rwb" edc:stimtype="Record"/>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F886240" edc:_begin="0x0" edc:_end="0xa0" edc:_modsrc="DOS-01618_TRAE_Ports.Module" edc:_refcount="2" edc:access="----------------nnnn------------" edc:cname="ODCC" edc:desc="" edc:grp="PORTC" edc:impl="0xfffff000" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------0000------------" edc:name="ODCC" edc:nzwidth="0x20" edc:por="----------------0000------------" edc:portals="CLR SET INV" ltx:memberofperipheral="PORTC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="ODCC12" edc:desc="" edc:mask="0x1" edc:name="ODCC12" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="ODCC13" edc:desc="" edc:mask="0x1" edc:name="ODCC13" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="ODCC14" edc:desc="" edc:mask="0x1" edc:name="ODCC14" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ODCC15" edc:desc="" edc:mask="0x1" edc:name="ODCC15" edc:nzwidth="0x1"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0x0" edc:name="w" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F886250" edc:_begin="0x0" edc:_end="0xa0" edc:_modsrc="DOS-01618_TRAE_Ports.Module" edc:_refcount="2" edc:access="----------------nnnn------------" edc:cname="CNPUC" edc:desc="" edc:grp="PORTC" edc:impl="0xfffff000" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------xxxx------------" edc:name="CNPUC" edc:nzwidth="0x20" edc:por="----------------xxxx------------" edc:portals="CLR SET INV" ltx:memberofperipheral="PORTC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="CNPUC12" edc:desc="" edc:mask="0x1" edc:name="CNPUC12" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPUC13" edc:desc="" edc:mask="0x1" edc:name="CNPUC13" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPUC14" edc:desc="" edc:mask="0x1" edc:name="CNPUC14" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPUC15" edc:desc="" edc:mask="0x1" edc:name="CNPUC15" edc:nzwidth="0x1"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0x0" edc:name="w" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
